// 상태머신
// 유니코드

const CHO_SONG = {
  ㄱ: 0,
  ㄲ: 1,
  ㄴ: 2,
  ㄷ: 3,
  ㄸ: 4,
  ㄹ: 5,
  ㅁ: 6,
  ㅂ: 7,
  ㅃ: 8,
  ㅅ: 9,
  ㅆ: 10,
  ㅇ: 11,
  ㅈ: 12,
  ㅉ: 13,
  ㅊ: 14,
  ㅋ: 15,
  ㅌ: 16,
  ㅍ: 17,
  ㅎ: 18,
}

const JUNG_SONG = {
  ㅏ: 0,
  ㅐ: 1,
  ㅑ: 2,
  ㅒ: 3,
  ㅓ: 4,
  ㅔ: 5,
  ㅕ: 6,
  ㅖ: 7,
  ㅗ: 8,
  ㅘ: 9,
  ㅙ: 10,
  ㅚ: 11,
  ㅛ: 12,
  ㅜ: 13,
  ㅝ: 14,
  ㅞ: 15,
  ㅟ: 16,
  ㅠ: 17,
  ㅡ: 18,
  ㅢ: 19,
  ㅣ: 20,
}

const JONG_SONG = {
  '': 0,
  ㄱ: 1,
  ㄲ: 2,
  ㄱㅅ: 3,
  ㄴ: 4,
  ㄴㅈ: 5,
  ㄴㅎ: 6,
  ㄷ: 7,
  ㄹ: 8,
  ㄹㄱ: 9,
  ㄹㅁ: 10,
  ㄹㅂ: 11,
  ㄹㅅ: 12,
  ㄹㅌ: 13,
  ㄹㅍ: 14,
  ㄹㅎ: 15,
  ㅁ: 16,
  ㅂ: 17,
  ㅂㅅ: 118,
  ㅅ: 19,
  ㅆ: 20,
  ㅇ: 21,
  ㅈ: 22,
  ㅊ: 23,
  ㅋ: 24,
  ㅌ: 25,
  ㅍ: 26,
  ㅎ: 27,
}

const hangul = (cho, jung, jong) => {
  return String.fromCharCode(0xac00 + 21 * 28 * cho + 28 * jung + jong)
}

console.log(hangul(CHO_SONG['ㄴ'], JUNG_SONG['ㅏ'], JONG_SONG['ㄴ']))
